#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudposse-s3-homework/cloudposse-s3/runs/run-rwm2gt11J9Tdg9RF

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_s3_bucket_object.index will be created
  + resource "aws_s3_bucket_object" "index" {
      + acl                    = "private"
      + bucket                 = "eg-prod-venkata-app-origin"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "app/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.acm_request_certificate.aws_acm_certificate.default[0] will be created
  + resource "aws_acm_certificate" "default" {
      + arn                       = (known after apply)
      + domain_name               = "cloudposse.venkatamutyala.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.cloudposse.venkatamutyala.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "cloudposse.venkatamutyala.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.cloudposse.venkatamutyala.com",
          + "cloudposse.venkatamutyala.com",
        ]
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm_request_certificate.aws_acm_certificate_validation.default[0] will be created
  + resource "aws_acm_certificate_validation" "default" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.acm_request_certificate.aws_route53_record.default["*.cloudposse.venkatamutyala.com"] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z00374151LLTPF2R9ZEOQ"
    }

  # module.acm_request_certificate.aws_route53_record.default["cloudposse.venkatamutyala.com"] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = "Z00374151LLTPF2R9ZEOQ"
    }

  # module.cdn.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.cdn.data.aws_iam_policy_document.s3_origin[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_origin"  {
      + id            = (known after apply)
      + json          = (known after apply)
      + override_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::eg-prod-venkata-app-origin/*",
            ]
          + sid       = "S3GetObjectForCloudFront"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::eg-prod-venkata-app-origin",
            ]
          + sid       = "S3ListBucketForCloudFront"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.cdn.data.aws_iam_policy_document.s3_ssl_only[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_ssl_only"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "ForceSSLOnlyAccess"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.cdn.aws_cloudfront_distribution.default[0] will be created
  + resource "aws_cloudfront_distribution" "default" {
      + aliases                        = (known after apply)
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Managed by Terraform"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Name"      = "eg-prod-venkata-app"
          + "Namespace" = "eg"
          + "Stage"     = "prod"
        }
      + tags_all                       = {
          + "Name"      = "eg-prod-venkata-app"
          + "Namespace" = "eg"
          + "Stage"     = "prod"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 60
          + max_ttl                = 31536000
          + min_ttl                = 0
          + target_origin_id       = "eg-prod-venkata-app"
          + trusted_key_groups     = []
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Origin",
                ]
              + query_string            = false
              + query_string_cache_keys = []

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "eg-prod-venkata-app"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = (known after apply)
          + minimum_protocol_version       = (known after apply)
          + ssl_support_method             = (known after apply)
        }
    }

  # module.cdn.aws_cloudfront_origin_access_identity.default[0] will be created
  + resource "aws_cloudfront_origin_access_identity" "default" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "eg-prod-venkata-app"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.cdn.aws_s3_bucket.origin[0] will be created
  + resource "aws_s3_bucket" "origin" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "eg-prod-venkata-app-origin"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Attributes" = "origin"
          + "Name"       = "eg-prod-venkata-app-origin"
          + "Namespace"  = "eg"
          + "Stage"      = "prod"
        }
      + tags_all                    = {
          + "Attributes" = "origin"
          + "Name"       = "eg-prod-venkata-app-origin"
          + "Namespace"  = "eg"
          + "Stage"      = "prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "s3.cloudposse.venkatamutyala.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3600
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.cdn.aws_s3_bucket_ownership_controls.origin[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "origin" {
      + bucket = "eg-prod-venkata-app-origin"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.cdn.aws_s3_bucket_policy.default[0] will be created
  + resource "aws_s3_bucket_policy" "default" {
      + bucket = "eg-prod-venkata-app-origin"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.cdn.time_sleep.wait_for_aws_s3_bucket_settings[0] will be created
  + resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
      + create_duration  = "30s"
      + destroy_duration = "30s"
      + id               = (known after apply)
    }

  # module.cdn.module.dns.aws_route53_record.default["s3.cloudposse.venkatamutyala.com"] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "s3.cloudposse.venkatamutyala.com"
      + type            = "A"
      + zone_id         = "Z00374151LLTPF2R9ZEOQ"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.cdn.module.dns.aws_route53_record.ipv6["s3.cloudposse.venkatamutyala.com"] will be created
  + resource "aws_route53_record" "ipv6" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "s3.cloudposse.venkatamutyala.com"
      + type            = "AAAA"
      + zone_id         = "Z00374151LLTPF2R9ZEOQ"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @venkatamutyala, Action: `pull_request`*